ex1_kakas/app/controllers/products_controller.rb

  def create
    @products = Product.all #給_index.html.erb用
    @product = Product.new(product_params)

    if @product.save
---
SELECT "products".* FROM "products"
INSERT INTO "products" ("title", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "大俠愛吃漢堡飽"], ["price", 300], ["created_at", "2016-08-29 08:18:28.804462"], ["updated_at", "2016-08-29 08:18:28.804462"]]

  def update
    @products = Product.all
    @product = Product.find(params[:id])

    if @product.update(product_params)
---
SELECT "products".* FROM "products"
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "products" SET "title" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "拉雅漢堡"], ["updated_at", "2016-08-29 08:47:38.066454"], ["id", 6]]

  def destroy
    @products = Product.all
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT "products".* FROM "products"
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 7]]